pmo-dataset/variations/graphviz_with_ids/33.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "User_1" [label="Send sketches to an\nartist"];
  "User_2" [label="Tell artist to\nchange"];
  "User_3" [label="Choose the color"];
  "User_4" [label="Check color level"];
  "User_5" [label="Order color"];
  "User_6" [label="Turn on the printer"];
  "User_7" [label="Generate gcode file"];
  "User_8" [label="Print the model"];
  "Receive_1" [label="Receive result"];
  "Receive_2" [label="Receive status"];
  "Receive_3" [label="Receive order\nconfirmation"];
  "Manual_1" [label="Put it on shopping\nlist"];
  "Manual_2" [label="Color received"];
  "StartNoneEvent_1" [shape=circle, label="Create a 3D model"];
  "EndNoneEvent_1" [shape=circle, penwidth=4, label="Model printed"];
  "ExclusiveGateway_1" [shape=diamond, label="Satisfied with\nresult?"];
  "ExclusiveGateway_2" [shape=diamond, label="X"];
  "ExclusiveGateway_3" [shape=diamond, label="In stock?"];
  "ExclusiveGateway_4" [shape=diamond, label="Under 100g?"];
  "ExclusiveGateway_5" [shape=diamond, label="X"];
  "ExclusiveGateway_6" [shape=diamond, label="X"];
  "ExclusiveGateway_7" [shape=diamond, label="Heated?"];
  "ExclusiveGateway_8" [shape=diamond, label="X"];
  "ParallelGateway_1" [shape=diamond, label="+"];
  "ParallelGateway_2" [shape=diamond, label="+"];

  "User_1" -> "Receive_1";
  "Receive_1" -> "ExclusiveGateway_1";
  "User_2" -> "ExclusiveGateway_2";
  "ExclusiveGateway_2" -> "User_1";
  "StartNoneEvent_1" -> "ExclusiveGateway_2";
  "ExclusiveGateway_1" -> "User_3" [label="Yes"];
  "User_3" -> "ExclusiveGateway_3";
  "ExclusiveGateway_3" -> "User_4" [label="Yes"];
  "User_4" -> "ExclusiveGateway_4";
  "ExclusiveGateway_4" -> "Manual_1" [label="Yes"];
  "ExclusiveGateway_4" -> "ExclusiveGateway_5" [label="No"];
  "Manual_1" -> "ExclusiveGateway_5";
  "ExclusiveGateway_3" -> "User_5" [label="No"];
  "ExclusiveGateway_5" -> "ExclusiveGateway_6";
  "User_5" -> "Receive_3";
  "ExclusiveGateway_6" -> "User_6";
  "User_6" -> "ParallelGateway_1";
  "ParallelGateway_1" -> "User_7";
  "Receive_2" -> "ExclusiveGateway_7";
  "ParallelGateway_1" -> "ExclusiveGateway_8";
  "ExclusiveGateway_8" -> "Receive_2";
  "ExclusiveGateway_7" -> "ParallelGateway_2" [label="Yes"];
  "User_7" -> "ParallelGateway_2";
  "ParallelGateway_2" -> "User_8";
  "User_8" -> "EndNoneEvent_1";
  "ExclusiveGateway_7" -> "ExclusiveGateway_8" [label="No"];
  "Receive_3" -> "Manual_2";
  "Manual_2" -> "ExclusiveGateway_6";
  "ExclusiveGateway_1" -> "User_2" [label="No"];
}
